Revit 2024 API
FilterableValueProvider.GetIntegerValue Method
 Gets an integer value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int GetIntegerValue(
	Element element
)
Visual Basic
Public Function GetIntegerValue ( _
	element As Element _
) As Integer
Visual C++
public:
int GetIntegerValue(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to query.
Return Value
 The integer value from the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace